# Brewfile for Tory Clasen

## Taps
tap "homebrew/bundle"
tap "tilt-dev/tap"
tap "garden-io/garden"
tap "knative/client"
tap "aquasecurity/trivy"
tap "coder/coder"

## Terminal Experience
brew "zsh"
brew "zsh-completions"
cask "iterm2"

## Better Shell Tooling
brew "aspell"
brew "bat"
brew "binutils"
brew "binwalk"
brew "coreutils"
brew "curl"
brew "diffutils"
brew "dockutil"
brew "findutils"
brew "grep"
brew "jq"
brew "openssl"
brew "tldr"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "yq"

## Developer Tooling

### Generic
brew "apko"
brew "docker"
brew "git"
brew "make"
brew "trivy"
brew "convco"
brew "gh"
brew "coder/coder/coder"
cask "ngrok"
cask "1password"
cask "1password-cli"
cask "visual-studio-code"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode-remote.remote-containers"
vscode "streetsidesoftware.code-spell-checker"
vscode "redhat.vscode-yaml"
vscode "ms-vsliveshare.vsliveshare"
vscode "donjayamanne.githistory"
vscode "bradlc.vscode-tailwindcss"
vscode "gruntfuggly.todo-tree"
vscode "eamodio.gitlens"
vscode "tamasfe.even-better-toml"
vscode "sonarsource.sonarlint-vscode"
vscode "yzhang.markdown-all-in-one"
vscode "github.vscode-github-actions"
vscode "tomoki1207.pdf"
vscode "coder.coder-remote"
vscode "usernamehw.errorlens"

### Cloud
brew "aws-shell"
brew "awscli"
brew "pulumi"

### Database
cask "mongodb-compass"

### Golang
brew "ko"
brew "gopls"
vscode "golang.go"

### Rust
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "vadimcn.vscode-lldb"

### JavaScript
brew "node"
brew "node@20"
vscode "ms-vscode.vscode-typescript-next"
vscode "dbaeumer.vscode-eslint"

### Python
brew "pipx"
brew "python@3.8"
brew "python@3.9"
brew "python@3.10"
brew "python@3.11"
vscode "charliermarsh.ruff"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.mypy-type-checker"

## Kubernetes Tooling
brew "eksctl"
brew "helm"
brew "kube-linter"
brew "kubernetes-cli"
brew "minikube"
brew "stern"
brew "tilt-dev/tap/ctlptl"
brew "tilt-dev/tap/tilt"
brew "argo"
brew "vcluster"
brew "k9s"
brew "kind"
brew "kubectx"
brew "kubeseal"
brew "clusterctl"
brew "clusterawsadm"
brew "garden-io/garden/garden-cli"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
# bridge to k8s
vscode "mindaro.mindaro"
vscode "mindaro-dev.file-downloader"

## MacOS Enhancements
cask "caffeine"
cask "rectangle"

## Productivity Tools
cask "drawio"
cask "firefox"
cask "microsoft-remote-desktop"
cask "onedrive"
cask "notion"
cask "spotify"

## Security
cask "pritunl"

## Communication Tools
cask "discord"
cask "microsoft-teams"
cask "slack"
cask "zoom"
