## Taps
tap "homebrew/bundle"
tap "tilt-dev/tap"
tap "garden-io/garden"
tap "knative/client"
tap "aquasecurity/trivy"
tap "coder/coder"
tap "styrainc/packages"
tap "codecrafters-io/tap"
tap "siderolabs/tap"

## Terminal Experience
brew "zsh"
cask "alacritty"

## Better Shell Tooling
brew "aspell"
brew "bat"
brew "uutils-coreutils"
brew "curl"
brew "gnu-sed"
brew "diffutils"
brew "findutils"
brew "ripgrep"
brew "jq"
brew "yq"
brew "openssl"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "tmux"

## Developer Tooling

### Generic
brew "apko"
brew "docker"
brew "git"
brew "make"
brew "go-task"
brew "trivy"
brew "convco"
brew "gh"
brew "coder/coder/coder"
brew "codecrafters-io/tap/codecrafters"
cask "ngrok"
cask "1password"
cask "1password-cli"
cask "visual-studio-code"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode-remote.remote-containers"
vscode "streetsidesoftware.code-spell-checker"
vscode "redhat.vscode-yaml"
vscode "ms-vsliveshare.vsliveshare"
vscode "donjayamanne.githistory"
vscode "bradlc.vscode-tailwindcss"
vscode "gruntfuggly.todo-tree"
vscode "eamodio.gitlens"
vscode "tamasfe.even-better-toml"
vscode "sonarsource.sonarlint-vscode"
vscode "yzhang.markdown-all-in-one"
vscode "github.vscode-github-actions"
vscode "tomoki1207.pdf"
vscode "coder.coder-remote"
vscode "usernamehw.errorlens"
vscode "github.vscode-pull-request-github"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "fill-labs.dependi"

### Cloud
brew "pulumi"

### Database
cask "mongodb-compass"

### Golang
brew "ko"
brew "gopls"
vscode "golang.go"

### Rust
vscode "rust-lang.rust-analyzer"
vscode "vadimcn.vscode-lldb"

### JavaScript
vscode "ms-vscode.vscode-typescript-next"
vscode "dbaeumer.vscode-eslint"

### Python
brew "uv"
vscode "charliermarsh.ruff"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.debugpy"

### Open Policy Agent
brew "opa"
brew "styrainc/packages/regal"
brew "oras"
vscode "tsandall.opa"

## Kubernetes Tooling
brew "eksctl"
brew "helm"
brew "kube-linter"
brew "kubernetes-cli"
brew "openshift-cli"
brew "minikube"
brew "stern"
brew "tilt-dev/tap/ctlptl"
brew "tilt-dev/tap/tilt"
brew "argo"
brew "vcluster"
brew "k9s"
brew "kind"
brew "kubectx"
brew "kubeseal"
brew "clusterctl"
brew "clusterawsadm"
brew "garden-io/garden/garden-cli"
brew "siderolabs/tap/talosctl"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
# bridge to k8s
vscode "mindaro.mindaro"
vscode "mindaro-dev.file-downloader"

## MacOS Enhancements
cask "rectangle"

## Productivity Tools
cask "drawio"
cask "firefox"
cask "microsoft-remote-desktop"
cask "microsoft-auto-update"
cask "onedrive"
cask "obsidian"
cask "spotify"

## Security
cask "pritunl"

## Communication Tools
cask "discord"
cask "microsoft-teams"
cask "slack"
cask "zoom"
